{
  "tld": {
    "__other__": 0,
    "co.za": 1
  },
  "country": {
    "__other__": 0,
    "AD": 1,
    "AE": 2,
    "AF": 3,
    "AG": 4,
    "AI": 5,
    "AL": 6,
    "AM": 7,
    "AO": 8,
    "AQ": 9,
    "AR": 10,
    "AS": 11,
    "AT": 12,
    "AU": 13,
    "AW": 14,
    "AX": 15,
    "AZ": 16,
    "BA": 17,
    "BB": 18,
    "BD": 19,
    "BE": 20,
    "BF": 21,
    "BG": 22,
    "BH": 23,
    "BI": 24,
    "BJ": 25,
    "BL": 26,
    "BM": 27,
    "BN": 28,
    "BO": 29,
    "BQ": 30,
    "BR": 31,
    "BS": 32,
    "BT": 33,
    "BV": 34,
    "BW": 35,
    "BY": 36,
    "BZ": 37,
    "CA": 38,
    "CC": 39,
    "CD": 40,
    "CF": 41,
    "CG": 42,
    "CH": 43,
    "CI": 44,
    "CK": 45,
    "CL": 46,
    "CM": 47,
    "CN": 48,
    "CO": 49,
    "CR": 50,
    "CU": 51,
    "CV": 52,
    "CW": 53,
    "CX": 54,
    "CY": 55,
    "CZ": 56,
    "DE": 57,
    "DJ": 58,
    "DK": 59,
    "DM": 60,
    "DO": 61,
    "DZ": 62,
    "EC": 63,
    "EE": 64,
    "EG": 65,
    "EH": 66,
    "ER": 67,
    "ES": 68,
    "ET": 69,
    "FI": 70,
    "FJ": 71,
    "FK": 72,
    "FM": 73,
    "FO": 74,
    "FR": 75,
    "GA": 76,
    "GB": 77,
    "GD": 78,
    "GE": 79,
    "GF": 80,
    "GG": 81,
    "GH": 82,
    "GI": 83,
    "GL": 84,
    "GM": 85,
    "GN": 86,
    "GP": 87,
    "GQ": 88,
    "GR": 89,
    "GS": 90,
    "GT": 91,
    "GU": 92,
    "GW": 93,
    "GY": 94,
    "HK": 95,
    "HM": 96,
    "HN": 97,
    "HR": 98,
    "HT": 99,
    "HU": 100,
    "ID": 101,
    "IE": 102,
    "IL": 103,
    "IM": 104,
    "IN": 105,
    "IO": 106,
    "IQ": 107,
    "IR": 108,
    "IS": 109,
    "IT": 110,
    "JE": 111,
    "JM": 112,
    "JO": 113,
    "JP": 114,
    "KE": 115,
    "KG": 116,
    "KH": 117,
    "KI": 118,
    "KM": 119,
    "KN": 120,
    "KP": 121,
    "KR": 122,
    "KW": 123,
    "KY": 124,
    "KZ": 125,
    "LA": 126,
    "LB": 127,
    "LC": 128,
    "LI": 129,
    "LK": 130,
    "LR": 131,
    "LS": 132,
    "LT": 133,
    "LU": 134,
    "LV": 135,
    "LY": 136,
    "MA": 137,
    "MC": 138,
    "MD": 139,
    "ME": 140,
    "MF": 141,
    "MG": 142,
    "MH": 143,
    "MK": 144,
    "ML": 145,
    "MM": 146,
    "MN": 147,
    "MO": 148,
    "MP": 149,
    "MQ": 150,
    "MR": 151,
    "MS": 152,
    "MT": 153,
    "MU": 154,
    "MV": 155,
    "MW": 156,
    "MX": 157,
    "MY": 158,
    "MZ": 159,
    "NA": 160,
    "NC": 161,
    "NE": 162,
    "NF": 163,
    "NG": 164,
    "NI": 165,
    "NL": 166,
    "NO": 167,
    "NP": 168,
    "NR": 169,
    "NU": 170,
    "NZ": 171,
    "OM": 172,
    "PA": 173,
    "PE": 174,
    "PF": 175,
    "PG": 176,
    "PH": 177,
    "PK": 178,
    "PL": 179,
    "PM": 180,
    "PN": 181,
    "PR": 182,
    "PS": 183,
    "PT": 184,
    "PW": 185,
    "PY": 186,
    "QA": 187,
    "RE": 188,
    "RO": 189,
    "RS": 190,
    "RU": 191,
    "RW": 192,
    "SA": 193,
    "SB": 194,
    "SC": 195,
    "SD": 196,
    "SE": 197,
    "SG": 198,
    "SH": 199,
    "SI": 200,
    "SJ": 201,
    "SK": 202,
    "SL": 203,
    "SM": 204,
    "SN": 205,
    "SO": 206,
    "SR": 207,
    "SS": 208,
    "ST": 209,
    "SV": 210,
    "SX": 211,
    "SY": 212,
    "SZ": 213,
    "TC": 214,
    "TD": 215,
    "TF": 216,
    "TG": 217,
    "TH": 218,
    "TJ": 219,
    "TK": 220,
    "TL": 221,
    "TM": 222,
    "TN": 223,
    "TO": 224,
    "TR": 225,
    "TT": 226,
    "TV": 227,
    "TW": 228,
    "TZ": 229,
    "UA": 230,
    "UG": 231,
    "UM": 232,
    "US": 233,
    "UY": 234,
    "UZ": 235,
    "VA": 236,
    "VC": 237,
    "VE": 238,
    "VG": 239,
    "VI": 240,
    "VN": 241,
    "VU": 242,
    "WF": 243,
    "WS": 244,
    "YE": 245,
    "YT": 246,
    "ZA": 247,
    "ZM": 248,
    "ZW": 249
  },
  "issuer": {
    "__other__": 0,
    "cloudflare": 1,
    "amazon.com inc": 2,
    "amazon.com  inc.": 3,
    "akamai international b.v.": 4,
    "google llc": 5,
    "microsoft corporation": 6,
    "akamai technologies  inc.": 7,
    "unified layer": 8,
    "namecheap  inc.": 9,
    "digitalocean  llc": 10,
    "ovh sas": 11,
    "hetzner online gmbh": 12,
    "godaddy.com  llc": 13,
    "the constant company  llc": 14,
    "hostinger international limited": 15,
    "cogent communications": 16,
    "cnservers llc": 17,
    "softlayer technologies inc.": 18,
    "bgpnet global asn": 19,
    "google": 20,
    "domain names registrar reg.ru  ltd": 21,
    "ntt communications corporation": 22,
    "servers.com  inc.": 23,
    "linode  llc": 24,
    "hangzhou alibaba advertising co. ltd.": 25,
    "alibaba (us) technology co.  ltd.": 26,
    "fastly": 27,
    "tencent building  kejizhongyi avenue": 28,
    "peg tech inc": 29,
    "leaseweb usa  inc.": 30,
    "multacom corporation": 31,
    "centurylink communications  llc": 32,
    "m247 ltd": 33,
    "colocrossing": 34,
    "african network information center": 35,
    "host europe gmbh": 36,
    "korea telecom": 37,
    "leaseweb netherlands b.v.": 38,
    "contabo gmbh": 39,
    "dxtl tseung kwan o service": 40,
    "quadranet enterprises llc": 41,
    "china unicom china169 backbone": 42,
    "egihosting": 43,
    "1&1 ionos se": 44,
    "gmo internet": 45,
    "hong kong megalayer technology co. limited": 46,
    "ooo network of data-centers selectel": 47,
    "power line datacenter": 48,
    "chinanet": 49,
    "shenzhen tencent computer systems company limited": 50,
    "deutsche telekom ag": 51,
    "apple inc.": 52,
    "ntt america  inc.": 53,
    "confluence networks inc": 54,
    "timeweb ltd.": 55,
    "mivocloud srl": 56,
    "verizon": 57,
    "dimension network and communication limited": 58,
    "liquid web  l.l.c": 59,
    "nforce entertainment b.v.": 60,
    "inmotion hosting  inc.": 61,
    "incapsula inc": 62,
    "accelerated it services & consulting gmbh": 63,
    "datacamp limited": 64,
    "sharktech": 65,
    "china telecom (group)": 66,
    "lg dacom corporation": 67,
    "trellian pty. limited": 68,
    "quickpacket  llc": 69,
    "sony network communications inc.": 70,
    "online s.a.s.": 71,
    "hostwinds llc.": 72,
    "level 3 parent  llc": 73,
    "tcloudnet": 74,
    "hivelocity  inc.": 75,
    "limestone networks  inc.": 76,
    "cloudie limited": 77,
    "netsec limited": 78,
    "bl networks": 79,
    "sk broadband co ltd": 80,
    "pjsc ukrtelecom": 81,
    "wildcard uk limited": 82,
    "digital energy technologies ltd.": 83,
    "new dream network": 84,
    "sun network (hong kong) limited - hongkong backbone": 85,
    "oracle corporation": 86,
    "sprint": 87,
    "esited solutions": 88,
    "daou technology": 89,
    "optage inc.": 90,
    "ucloud information technology (hk) limited": 91,
    "verotel international b.v.": 92,
    "biglobe inc.": 93,
    "aptum technologies": 94,
    "clouddata networks inc.": 95,
    "g-core labs s.a.": 96,
    "pq hosting s.r.l.": 97,
    "pdr": 98,
    "forewin telecom group limited  isp at hk": 99,
    "unit a17 9/f silvercorp int l tower 707-713 nathan rd": 100,
    "gigabit hosting sdn bhd": 101,
    "clayer limited": 102,
    "frantech solutions": 103,
    "claro s.a.": 104,
    "1&1 versatel deutschland gmbh": 105,
    "tm net  internet service provider": 106,
    "sondercloud limited": 107,
    "singlehop llc": 108,
    "server central network": 109,
    "internap holding llc": 110,
    "att services inc": 111,
    "reflected networks  inc.": 112,
    "luogelang (france) limited": 113,
    "softbank bb corp.": 114,
    "zhejiang taobao network co. ltd": 115,
    "dedipath": 116,
    "xserver inc.": 117,
    "interserver  inc": 118,
    "sakura internet inc.": 119,
    "private network": 120,
    "eonix corporation": 121,
    "sucuri": 122,
    "arteria networks corporation": 123,
    "a2 hosting  inc.": 124,
    "beget llc": 125,
    "hostdime.com  inc.": 126,
    "llc baxet": 127,
    "facebook  inc.": 128,
    "ddos guard ltd": 129,
    "kddi corporation": 130,
    "jsc iot": 131,
    "serverel inc.": 132,
    "team internet ag": 133,
    "contabo inc.": 134,
    "1984 ehf": 135,
    "binariang berhad": 136,
    "reliablesite.net llc": 137,
    "automattic  inc": 138,
    "cloudflare london  llc": 139,
    "aruba s.p.a.": 140,
    "sedo": 141,
    "rackspace hosting": 142,
    "zomro b.v.": 143,
    "ht": 144,
    "psychz networks": 145,
    "itl llc": 146,
    "dod network information center": 147,
    "glesys ab": 148,
    "shinjiru technology sdn bhd": 149,
    "charter communications inc": 150,
    "24 shells": 151,
    "windstream communications llc": 152,
    "oath holdings inc.": 153,
    "60 market square p.o. box 364": 154,
    "comcast": 155,
    "british telecommunications plc": 156,
    "telecom italia s.p.a.": 157,
    "shanghai blue cloud technology co. ltd": 158,
    "host sailor ltd": 159,
    "secured servers llc": 160,
    "anchnet asia limited": 161,
    "hosting ukraine ltd": 162,
    "hostkey b.v.": 163,
    "appnexus  inc": 164,
    "zenlayer inc": 165,
    "private layer inc": 166,
    "innovation it solutions ltd": 167,
    "ths provider servios de comunicao multimdia lt": 168,
    "uab cherry servers": 169,
    "data communication business group": 170,
    "dataweb global group bv": 171,
    "telefonica de espana": 172,
    "kurun cloud inc": 173,
    "gtt communications inc.": 174,
    "highwinds network group  inc.": 175,
    "yottaa  inc": 176,
    "hong kong communications international co.  limited": 177,
    "starcloud global pte.  ltd.": 178,
    "jsc eurotelecom": 179,
    "strato ag": 180,
    "newfold digital  inc.": 181,
    "dreamscape networks limited": 182,
    "natcoweb corp.": 183,
    "tierpoint": 184,
    "vietnam posts and telecommunications group": 185,
    "retn limited": 186,
    "sinet": 187,
    "leaseweb deutschland gmbh": 188,
    "eurobyte llc": 189,
    "a small orange llc": 190,
    "jsc ru-center": 191,
    "zayo bandwidth": 192,
    "webzilla b.v.": 193,
    "enzu inc": 194,
    "vodafone gmbh": 195,
    "idc china telecommunications corporation": 196,
    "leaseweb asia pacific pte. ltd.": 197,
    "flexential colorado corp.": 198,
    "tim windelschmidt": 199,
    "vnpt corp": 200,
    "network solutions  llc": 201,
    "yandex.cloud llc": 202,
    "dxtl": 203,
    "claranet ltd": 204,
    "jumpline inc": 205,
    "ehostict": 206,
    "iomart cloud services limited": 207,
    "one.com a s": 208,
    "garant-park-internet llc": 209,
    "scalaxy b.v.": 210,
    "huawei cloud service data center": 211,
    "intercontinental internet data corp": 212,
    "hawk host inc.": 213,
    "twitter inc.": 214,
    "weebly": 215,
    "hostus": 216,
    "fop hornostay mykhaylo ivanovych": 217,
    "jsc rtcomm.ru": 218,
    "ting fiber inc": 219,
    "salesforce.com  inc.": 220,
    "cdnetworks": 221,
    "myloc managed it ag": 222,
    "neustar  inc.": 223,
    "krypt technologies": 224,
    "ddos-guard corp.": 225,
    "telus communications inc.": 226,
    "layerhost": 227,
    "internet hostspace global inc": 228,
    "jsc mediasoft ekspert": 229,
    "internet initiative japan": 230,
    "pjsc rostelecom": 231,
    "ntt pc communications  inc.": 232,
    "perviy tsod llc": 233,
    "input output flood llc": 234,
    "west263 international limited": 235,
    "rumahweb indonesia": 236,
    "ihor hosting llc": 237,
    "llc management company svyaz": 238,
    "zoho": 239,
    "te data": 240,
    "asiatech data transmission company": 241,
    "centrilogic  inc.": 242,
    "hkbn enterprise solutions hk limited": 243,
    "ligne web services sarl": 244,
    "upcloud ltd": 245,
    "adform aps": 246,
    "nexeon technologies  inc.": 247,
    "delis llc": 248,
    "yisu cloud ltd": 249,
    "petersburg internet network ltd.": 250,
    "cctel sp. z o.o. sp. k.": 251,
    "nocix  llc": 252,
    "huawei clouds": 253,
    "worldstream b.v.": 254,
    "free sas": 255,
    "shenzhen katherine heng technology information co.  ltd.": 256,
    "locaweb servios de internet s/a": 257
  },
  "server": {
    "__other__": 0
  },
  "file_type": {
    "__other__": 0
  },
  "http_status": {
    "__other__": 0
  },
  "content_type": {
    "__other__": 0
  }
}